In [1]:
import pandas as pd

In [2]:
#series
#pd.series

In [3]:
li=[1,2,2.0,3.4,'One','two']
s1=pd.Series(li)
s1

0      1
1      2
2    2.0
3    3.4
4    One
5    two
dtype: object

In [4]:
li=[1,10,99,34,53,'nokesh','mca','alliance']
s1=pd.Series(li)
s1

0           1
1          10
2          99
3          34
4          53
5      nokesh
6         mca
7    alliance
dtype: object

In [5]:
li=[1,2,2.0,3.4,'One','two','True','False',]
s1=pd.Series(li)
s1

0        1
1        2
2      2.0
3      3.4
4      One
5      two
6     True
7    False
dtype: object

In [6]:
li=[1,2,2.0,232,34.324,556,6556.54,42342]
s1=pd.Series(li)
s1

0        1.000
1        2.000
2        2.000
3      232.000
4       34.324
5      556.000
6     6556.540
7    42342.000
dtype: float64

In [2]:
import pandas as pd
l2=pd.Series index1=([21,32,43,44,]))],index2=([32,34,56,65])
s1=pd.Series(s2)
s1

SyntaxError: unmatched ')' (2049180509.py, line 2)

In [18]:
data={
    'x':[10,20,30,40,50],
    'y':[10,20,30,40,50],
    'z':[10,20,30,40,50]}
df=pd.DataFrame(data)
print(df)

    x   y   z
0  10  10  10
1  20  20  20
2  30  30  30
3  40  40  40
4  50  50  50

In [20]:
d2={'Name':['John','Cataline','matt'],'Age':[50,45,30],'City':['Austin','San Franscisco','Boston'],'Marks':[70,80,95]}
df2=pd.DataFrame(d2)
df2

       Name  Age            City  Marks
0      John   50          Austin     70
1  Cataline   45  San Franscisco     80
2      matt   30          Boston     95

In [21]:
df={'Name':['John','Cataline','matt'],'Age':[50,45,30],'City':['Austin','San Franscisco','Boston'],'Marks':[70,80,95]}
s1=pd.DataFrame(li)
df

{'Name': ['John', 'Cataline', 'matt'],
 'Age': [50, 45, 30],
 'City': ['Austin', 'San Franscisco', 'Boston'],
 'Marks': [70, 80, 95]}

In [22]:
data=[['John',25,'Cataline',70],
      ['Cataline',30,'San Franscio',80],
      ['Matt',35,'Boston',90]]
columns=['Name','Age','City','Marks']

df=pd.DataFrame(data,columns=columns)
df

       Name  Age          City  Marks
0      John   25      Cataline     70
1  Cataline   30  San Franscio     80
2      Matt   35        Boston     90

In [24]:
data={'Product':['Laptop','Tablet','Smartphone','printer'],
      'price':[1200,300,800,150],
      'In stock':[True,False,True,True]}
df=pd.DataFrame(data,index=['p1','p2','p3','p4'])
df

       Product  price  In stock
p1      Laptop   1200      True
p2      Tablet    300     False
p3  Smartphone    800      True
p4     printer    150      True